app/Controllers/Noticia.php

    public function noticias(){

        if ($this->session->has('id')) {

            $noticias = $this->modeloNoticia->obtenerTodasLasNoticias();

            //mapeamos para el contenido de la tabla
            $cabecera = ['T&iacute;tulo', 'Categor&iacute;a', 'Estado', 'Fecha/estatus', 'Responsable/estatus',
                        'Ver/detalle'];



            $contenidoNoticias = array_map(function($item) {
                // Verificar si las variables están definidas
                $titulo = isset($item['titulo']) ? esc($item['titulo']) : 'No disponible';
                $categoria = isset($item['categoria']) ? esc($item['categoria']) : 'No disponible';
                $estado = $this->esActivo($item['es_activo']);
                $fecha = isset($item['fecha']) ? esc($item['fecha']) : 'No disponible';
                $responsable = isset($item['correo']) ? esc($item['correo']) : 'No disponible';
                $verHistorial = $this->verHistorial($item['id']);
                return [$titulo, $categoria, $estado, $fecha, $responsable, $verHistorial ];
            }, $noticias);

            $estadoModelo = model(ModeloEstado::class);
            $estados = $estadoModelo->find([1,2,5,6,7,9,10,12]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (5,9,10)