app/Controllers/Noticia.php

    public function getBorradores($idNoticia = 0, $offSet=0) {

        $noticia = $this->modeloNoticia->find($idNoticia);
---
SELECT *
FROM `noticia`
WHERE `noticia`.`id` = '49'

                }, $noticias);

                $estadoModelo = model(ModeloEstado::class);
                $estados = $estadoModelo->find([1,2]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (1,2)

    public function listadoTodasLasNoticias(){ //listadoTodasLasNoticias

        if ($this->session->has('id')) {

            $noticias = $this->modeloNoticia->obtenerTodasLasNoticias();

            //mapeamos para el contenido de la tabla
            $cabecera = ['T&iacute;tulo', 'Categor&iacute;a','Estado','Estatus', 'Fecha/estatus', 'Editor',
                        'Ver/detalle'];

            $contenidoNoticias = array_map(function($item) {
                // Verificar si las variables están definidas
                $titulo = isset($item['titulo']) ? esc($item['titulo']) : 'No disponible';
                $categoria = isset($item['categoria']) ? esc($item['categoria']) : 'No disponible';
                $estado = isset($item['estado']) ? esc($item['estado']) : 'No disponible';
                $es_activo = $this->esActivo($item['es_activo']);
                $fecha = isset($item['fecha']) ? esc($item['fecha']) : 'No disponible';
                $responsable = isset($item['correo']) ? esc($item['correo']) : 'No disponible';
                $verHistorial = $this->verHistorialDeOperacionesNoticia($item['id']);
                return [$titulo, $categoria, $estado, $es_activo, $fecha, $responsable, $verHistorial ];
            }, $noticias);

            $estadoModelo = model(ModeloEstado::class);
            $estados = $estadoModelo->find([1,2,5,6,7,9,10,12]);
---
SELECT *
FROM `estado`
WHERE `estado`.`id` IN (1,2,5,6,7,9,10,12)