app/Controllers/Usuario.php

SELECT *
FROM `usuario`
WHERE `correo` = 'jortiz@xn--gmai-jqa.com'
 LIMIT 1
---
    public function validarSesion(){

        helper('form');
        $data = $this->request->getPost(['correo', 'clave']);

        if (!$this->validateData($data, [
            'correo'  => [
                'rules' => 'required|max_length[50]|min_length[8]
                            |regex_match[/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/]',
                'errors' => [
                    'regex_match' => 'El formato del correo electrónico es incorrecto.',
                ]
            ],
            'clave' => [
                'rules' => 'required|min_length[8]|regex_match[/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/]',
                'errors' => [
                    'required' => 'El campo Clave es obligatorio.',
                    'min_length' => 'La clave debe tener al menos 8 caracteres.',
                    'regex_match' => 'La clave debe contener al menos una letra mayúscula, una letra minúscula, un número y un carácter especial.',
                ]
            ]
        ])) {
            // Manejar errores de validación aquí
            return $this->iniciarSesion();
        }

        $modeloUsuario = model(ModeloUsuario::class);
        $usuario = $modeloUsuario
                    ->where('correo', $data['correo'])
                    ->first();