app/Models/ModeloBorrador.php

        public function obtenerTotalBorradoresNoticia($idNoticia) {
            return $this->where(['id_noticia' => $idNoticia])
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `borrador`
WHERE `id_noticia` = '38'

        public function obtenerBorradoresNoticia($idNoticia, $offSet = 0) {
            return $this->asArray()
                        ->where(['id_noticia' => $idNoticia])
                        ->join('categoria','categoria.id = borrador.id_categoria')
                        ->orderBy('fecha_modificacion', 'DESC')
                        ->select('borrador.*, categoria.nombre as categoria')
                        ->findAll(2, $offSet);
---
SELECT `borrador`.*, `categoria`.`nombre` as `categoria`
FROM `borrador`
JOIN `categoria` ON `categoria`.`id` = `borrador`.`id_categoria`
WHERE `id_noticia` = '38'
ORDER BY `fecha_modificacion` DESC
 LIMIT 1, 2