app/Models/ModeloNoticia.php

        public function obtenerTodasLasNoticias()
        {
            // Subconsulta para obtener la última fecha de modificación para cada ID
            $subconsulta = '(SELECT MAX(fecha_modificacion)
                            FROM borrador
                            WHERE noticia.id = borrador.id_noticia
                            )';

            $subconsultaEstados = '(SELECT MAX(fecha)
            FROM estado_noticia
            WHERE estado_noticia.id_noticia = noticia.id)';

            $campos = "noticia.id as id,
                        noticia.es_activo,
                        borrador.titulo,
                        borrador.descripcion,
                        borrador.id as id_borrador,
                        borrador.imagen,
                        categoria.nombre as categoria,
                        borrador.id_categoria,
                        usuario.correo,
                        estado.nombre as estado,
                        estado_noticia.fecha"
                    ;
            $noticia =  $this->db->table($this->table)
                        ->join($this->tablaUsario,"noticia.id_usuario = usuario.id")
                        ->join($this->tablaBorrador, "noticia.id = $this->tablaBorrador.id_noticia")
                        ->join("estado_noticia", "estado_noticia.id_noticia = noticia.id")
                        ->join("estado", "estado.id = estado_noticia.id_estado")
                        ->join($this->tablaCategoria, "$this->tablaCategoria.id = $this->tablaBorrador.id_categoria")
                        ->where("$this->tablaBorrador.fecha_modificacion = $subconsulta")
                        ->where("$this->tablaEstadoNoticia.fecha = $subconsultaEstados")
                        ->select($campos)
                        ->orderBy('fecha','DESC')
                        ->get()->getResultArray();
---
SELECT `noticia`.`id` as `id`, `noticia`.`es_activo`, `borrador`.`titulo`, `borrador`.`descripcion`, `borrador`.`id` as `id_borrador`, `borrador`.`imagen`, `categoria`.`nombre` as `categoria`, `borrador`.`id_categoria`, `usuario`.`correo`, `estado`.`nombre` as `estado`, `estado_noticia`.`fecha`
FROM `noticia`
JOIN `usuario` ON `noticia`.`id_usuario` = `usuario`.`id`
JOIN `borrador` ON `noticia`.`id` = `borrador`.`id_noticia`
JOIN `estado_noticia` ON `estado_noticia`.`id_noticia` = `noticia`.`id`
JOIN `estado` ON `estado`.`id` = `estado_noticia`.`id_estado`
JOIN `categoria` ON `categoria`.`id` = `borrador`.`id_categoria`
WHERE borrador.fecha_modificacion = (SELECT MAX(fecha_modificacion) 
                            FROM borrador 
                            WHERE noticia.id = borrador.id_noticia
                            )
AND estado_noticia.fecha = (SELECT MAX(fecha) 
            FROM estado_noticia 
            WHERE estado_noticia.id_noticia = noticia.id)
ORDER BY `fecha` DESC

        public function obtenerNoticiasEstadoPublicada($idCategoria=0){

            $subconsulta = '(SELECT MAX(fecha)
                            FROM estado_noticia
                            WHERE estado_noticia.id_noticia = noticia.id)
                            ';

            $campos =  'noticia.id as id,
                        noticia.es_activo,
                        borrador.fecha_modificacion as fechaBorrador,
                        borrador.titulo,
                        borrador.descripcion,
                        borrador.id as id_borrador,
                        borrador.imagen,
                        categoria.nombre as categoria,
                        borrador.id_categoria,
                        estado_noticia.fecha,
                        usuario.correo ';



            $noticia =  $this->db->table($this->table)
            ->join("usuario","noticia.id_usuario = usuario.id")
            ->join("borrador", "noticia.id = borrador.id_noticia")
            ->join('categoria',"borrador.id_categoria = categoria.id")
            ->join('estado_noticia',"noticia.id = estado_noticia.id_noticia")
            ->where("es_activo = 1")
            ->where("fecha = $subconsulta")
            ->where( "id_estado",  5) ;
---
SELECT `noticia`.`id` as `id`, `noticia`.`es_activo`, `borrador`.`fecha_modificacion` as `fechaBorrador`, `borrador`.`titulo`, `borrador`.`descripcion`, `borrador`.`id` as `id_borrador`, `borrador`.`imagen`, `categoria`.`nombre` as `categoria`, `borrador`.`id_categoria`, `estado_noticia`.`fecha`, `usuario`.`correo`
FROM `noticia`
JOIN `usuario` ON `noticia`.`id_usuario` = `usuario`.`id`
JOIN `borrador` ON `noticia`.`id` = `borrador`.`id_noticia`
JOIN `categoria` ON `borrador`.`id_categoria` = `categoria`.`id`
JOIN `estado_noticia` ON `noticia`.`id` = `estado_noticia`.`id_noticia`
WHERE `es_activo` = 1
AND fecha = (SELECT MAX(fecha) 
                            FROM estado_noticia 
                            WHERE estado_noticia.id_noticia = noticia.id)
                            
AND `id_estado` = 5
AND `borrador`.`id_categoria` = '10'
GROUP BY `noticia`.`id`
ORDER BY `fecha` DESC