app/Models/ModeloEstadoNoticia.php

SELECT `noticia`.`id`
FROM `estado_noticia`
JOIN `noticia` ON `noticia`.`id` = `estado_noticia`.`id_noticia`
WHERE `es_activo` = 1
AND fecha = (SELECT MAX(fecha) 
                            FROM estado_noticia 
                            WHERE estado_noticia.id_noticia = noticia.id)
AND `id_estado` = 1
AND `fecha` <= DATE_SUB(CURRENT_TIMESTAMP(), INTERVAL 5 DAY)
GROUP BY `noticia`.`id`
---
        public function publicarAutomticamente(){

            $dias = config('MiConfiguracion')->dias;
           // var_dump($dias);

            $subconsulta = '(SELECT MAX(fecha)
                            FROM estado_noticia
                            WHERE estado_noticia.id_noticia = noticia.id)';

            $campos =  'noticia.id as id,
                        noticia.es_activo,
                        estado_noticia.fecha';

            $noticias =  $this->db->table("estado_noticia")
            ->join("noticia", "noticia.id = estado_noticia.id_noticia")
            ->where("es_activo = 1")
            ->where("fecha = $subconsulta")
            ->where("id_estado", 1)
            ->where("fecha <= DATE_SUB(CURRENT_TIMESTAMP(), INTERVAL 5 DAY)")
            ->groupBy('noticia.id')
            ->select('noticia.id')
            ->get()->getResultArray();

SELECT `noticia`.`id`, `fecha`
FROM `estado_noticia`
JOIN `noticia` ON `noticia`.`id` = `estado_noticia`.`id_noticia`
WHERE `es_activo` = 1
AND fecha = (SELECT MAX(fecha) 
                            FROM estado_noticia 
                            WHERE estado_noticia.id_noticia = noticia.id)
AND `id_estado` = 5
AND `fecha` < DATE_SUB(CURRENT_TIMESTAMP(), INTERVAL 6 DAY)
GROUP BY `noticia`.`id`
---
                ]);
            }

            $noticias =  $this->db->table("estado_noticia")
            ->join("noticia", "noticia.id = estado_noticia.id_noticia")
            ->where("es_activo = 1")
            ->where("fecha = $subconsulta")
            ->where("id_estado", 5)
            ->where("fecha < DATE_SUB(CURRENT_TIMESTAMP(), INTERVAL $dias DAY)")
            ->groupBy('noticia.id')
            ->select('noticia.id, fecha')
            ->get()->getResultArray();